---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRunExtendBelowRiserBase
source: html/5889ef9d-7af3-8639-db35-5a314272d590.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRunExtendBelowRiserBase Property

"Extend Below Riser Base": Extend Below Base

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRunExtendBelowRiserBase { get; }
```